Catalogs/ТочкиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТочкиДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПереопределен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиДоставки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ДоставкаТоваров.УстановитьДоступностьАдресовДоставки(Элементы);
	
	//++ Локализация
	Элементы.Наименование.КнопкаВыпадающегоСписка = Истина;
	//-- Локализация
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	СокращенноеНаименование = СокращенноеПредставлениеАдреса(
		Объект.Адрес,
		Объект.АдресЗначение,
		Не ЗначениеЗаполнено(Объект.ИдентификаторАдреса));
	
	ОбновитьСписокВыбораНаименования(СокращенноеНаименование);
	
	//++ Локализация
	Если ТекущийОбъект.ИдентификаторПереопределен
		И Не ПустаяСтрока(АдресПоИдентификаторуИзТекущихДанных) Тогда
		
		АдресПоИдентификатору = АдресПоИдентификаторуИзТекущихДанных;
		
	Иначе
		
		АдресПоИдентификатору = "";
		
	КонецЕсли;
	//-- Локализация
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	//++ Локализация
	
	Если Объект.ИдентификаторПереопределен Тогда
		
		ЗаполнитьАдресПоИдентификаторуТочкиДоставки(Объект.ИдентификаторТочкиДоставки, Истина);
		
	КонецЕсли;
	
	//-- Локализация
	
	УстановитьКомментарийАдреса();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//++ Локализация
	
	Если ТекущийОбъект.ИдентификаторПереопределен
		И Не ПустаяСтрока(АдресПоИдентификатору) Тогда
		
		АдресПоИдентификаторуИзТекущихДанных = АдресПоИдентификатору;
		
	Иначе
		
		АдресПоИдентификаторуИзТекущихДанных = "";
		
	КонецЕсли;
	
	//-- Локализация
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ПереопределитьИдентификаторПриИзменении(Элемент)
	
	//++ Локализация
	
	УстановитьВидимостьПолейИдентификаторов();
	
	Если Объект.ИдентификаторПереопределен Тогда
		
		ЗаполнитьАдресПоИдентификаторуТочкиДоставки(Объект.ИдентификаторТочкиДоставки);
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Адрес) Тогда
		
		Объект.АдресЗначенияПолей = "";
		Объект.АдресЗначение = "";
		Объект.ИдентификаторАдреса = "";
		
	Иначе
		
		ЗаполнитьПоляАдресаПоПредставлению();
		
	КонецЕсли;
	
	АдресПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыбораАдреса", ЭтотОбъект);
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдреса(Элемент, Объект.Адрес, Объект.АдресЗначение, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.Адрес = "";
	Объект.АдресЗначение = "";
	Объект.АдресЗначенияПолей = "";
	Объект.ИдентификаторАдреса = "";
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИдентификаторТочкиДоставкиПриИзменении(Элемент)
	
	//++ Локализация
	
	Если Объект.ИдентификаторПереопределен Тогда
		
		ЗаполнитьАдресПоИдентификаторуТочкиДоставки(Объект.ИдентификаторТочкиДоставки);
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ПараметрыПроцедуры = ОбщегоНазначенияУТКлиент.ПараметрыРазрешенияРедактированияРеквизитовОбъекта();
	ПараметрыПроцедуры.ОповещениеОРазблокировке = Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект);
	
	ОбщегоНазначенияУТКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект, ПараметрыПроцедуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//++ Локализация
	УстановитьВидимостьПолейИдентификаторов();
	//-- Локализация
	ОбновитьДоступностьПолейАдреса();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьПолейАдреса()
	
	ИменаЭлементов = Новый Массив; // Массив из Строка
	ИменаЭлементов.Добавить(Элементы.Адрес.Имя);
	ИменаЭлементов.Добавить(Элементы.Владелец.Имя);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаЭлементов,
		"ТолькоПросмотр",
		Объект.ОсновнаяТочка);
	
	Элементы.НеИспользуется.Доступность = Не Объект.ОсновнаяТочка;
	
КонецПроцедуры

&НаСервере
Процедура АдресПриИзмененииНаСервере()
	
	Объект.ИдентификаторАдреса = ДоставкаТоваровЛокализация.ИдентификаторАдресаТочкиДоставки(Объект.АдресЗначение);
	СокращенноеНаименование = СокращенноеПредставлениеАдреса(
		Объект.Адрес,
		Объект.АдресЗначение,
		Не ЗначениеЗаполнено(Объект.ИдентификаторАдреса));
	
	ОбновитьСписокВыбораНаименования(СокращенноеНаименование);
	
	Если Не ПустаяСтрока(СокращенноеНаименование) Тогда
		
		Объект.Наименование = СокращенноеНаименование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораНаименования(СокращенноеНаименование)
	
	Если Не ПустаяСтрока(СокращенноеНаименование) Тогда
		
		СписокВыбора = Элементы.Наименование.СписокВыбора;
		
		Если СписокВыбора.Количество() = 0 Тогда
			
			ЭлементСписка = СписокВыбора.Добавить();
			
		Иначе
			
			ЭлементСписка = СписокВыбора[0];
			
		КонецЕсли;
		
		ЭлементСписка.Значение = СокращенноеНаименование;
		
	КонецЕсли;
	
КонецПроцедуры

//++ Локализация

&НаСервере
Процедура УстановитьВидимостьПолейИдентификаторов()
	
	ПоляИдентификаторов = Новый Массив; // Массив из строка
	ПоляИдентификаторов.Добавить(Элементы.ИдентификаторТочкиДоставки.Имя);
	ПоляИдентификаторов.Добавить(Элементы.АдресПоИдентификатору.Имя);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ПоляИдентификаторов,
		"Видимость",
		Объект.ИдентификаторПереопределен);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторТочкиДоставки - Строка
//  ПриОткрытии - Булево
//
&НаКлиенте
Асинх Процедура ЗаполнитьАдресПоИдентификаторуТочкиДоставки(ИдентификаторТочкиДоставки, ПриОткрытии = Ложь)
	
	Если ПустаяСтрока(ИдентификаторТочкиДоставки)
		Или Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторТочкиДоставки) Тогда
		
		АдресПоИдентификатору = "";
		УдалитьАдресТочкиДоставкиИзСпискаВыбора();
		
	Иначе
		
		ДанныеАдреса = ДанныеАдресаПоИдентификатору(ИдентификаторТочкиДоставки);
		АдресПоИдентификатору = ДанныеАдреса.Представление;
		
		Если НЕ ПустаяСтрока(ДанныеАдреса.Представление) Тогда
			
			СокращенноеНаименование = СокращенноеПредставлениеАдреса(ДанныеАдреса.Представление, ДанныеАдреса.Значение);
		Иначе
			
			СокращенноеНаименование = "";
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(СокращенноеНаименование) Тогда
			
			ДобавитьАдресТочкиДоставкиВСписокВыбора(СокращенноеНаименование);
			
			Если Не ПриОткрытии Тогда
				
				Объект.Наименование = СокращенноеНаименование;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПриОткрытии Тогда
		АдресПоИдентификаторуИзТекущихДанных = АдресПоИдентификатору;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторТочкиДоставки - Строка - 
// 
// Возвращаемое значение:
//  Структура:
// * Значение - Строка - 
// * Представление - Строка - 
//
&НаСервереБезКонтекста
Функция ДанныеАдресаПоИдентификатору(Знач ИдентификаторТочкиДоставки)
	
	Результат = Новый Структура;
	Результат.Вставить("Значение", "");
	Результат.Вставить("Представление", "");
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("АдресВJSON", Истина);
	ПараметрыПолучения.Вставить("Муниципальный", Истина);
	
	ДанныеАдреса = РаботаСАдресами.АдресПоИдентификатору(ИдентификаторТочкиДоставки, ПараметрыПолучения);
	
	ПараметрыПредставления = УправлениеКонтактнойИнформацией.НовыеПараметрыПредставленияАдреса();
	ПараметрыПредставления.ВключатьПочтовыйИндекс = Ложь;
	ПараметрыПредставления.ВключатьСтрану = Ложь;
	
	ПредставлениеАдреса = УправлениеКонтактнойИнформацией.ПредставлениеАдреса(
		ДанныеАдреса,
		ПараметрыПредставления);
	
	Результат.Значение = ДанныеАдреса;
	Результат.Представление = ПредставлениеАдреса;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьАдресТочкиДоставкиВСписокВыбора(СокращенноеНаименование)
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	
	Если СписокВыбора.Количество() < 2 Тогда
		
		ЭлементСписка = СписокВыбора.Добавить();
		
	Иначе
		
		ЭлементСписка = СписокВыбора[1];
		
	КонецЕсли;
	
	ЭлементСписка.Значение = СокращенноеНаименование;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАдресТочкиДоставкиИзСпискаВыбора()
	
	Если Элементы.Наименование.СписокВыбора.Количество() = 2 Тогда
		
		Элементы.Наименование.СписокВыбора.Удалить(1);
		
	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

&НаСервереБезКонтекста
Функция СокращенноеПредставлениеАдреса(Адрес, АдресЗначение, ВСвободнойФорме = Ложь)
	
	СокращенноеПредставление = ДоставкаТоваровЛокализация.НаименованиеТочкиДоставкиПоАдресу(
		Адрес,
		АдресЗначение,
		ВСвободнойФорме);
	
	Возврат СокращенноеПредставление;
	
КонецФункции

// Параметры:
//  Результат - Неопределено
//            - Структура:
//   * КонтактнаяИнформация - Строка
//   * Значение - Строка
//   * Представление - Строка
//   * Комментарий - Строка
//  ДополнительныеПараметры - Произвольный
//
&НаКлиенте
Процедура ОбработатьРезультатВыбораАдреса(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Перенесем данные в форму
		Объект.АдресЗначенияПолей = Результат.КонтактнаяИнформация;
		Объект.АдресЗначение = Результат.Значение;
		Объект.Адрес = Результат.Представление;
		
		УстановитьКомментарийАдреса(Результат.Комментарий);
		
		АдресПриИзмененииНаСервере();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляАдресаПоПредставлению()
	
	ДоставкаТоваров.ЗаполнитьПоляАдресаПоПредставлению(Объект.Адрес, Объект.АдресЗначение, Объект.АдресЗначенияПолей);
	
КонецПроцедуры

// Параметры:
//  Результат - Массив из Строка
//  ДополнительныеПараметры - Структура
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив")
	   И Результат.Количество() > 0 Тогда
		
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомментарийАдреса(Комментарий = Неопределено)
	
	Если Комментарий = Неопределено Тогда
		
		Комментарий = КомментарийАдреса(Объект.АдресЗначение);
		
	КонецЕсли;
	
	Элементы.Адрес.РасширеннаяПодсказка.Заголовок = Комментарий;
	Если Не ПустаяСтрока(Комментарий) Тогда
		
		Элементы.Адрес.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
	Иначе
		
		Элементы.Адрес.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомментарийАдреса(Знач АдресЗначение)
	
	Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(АдресЗначение);
	Возврат Комментарий;
	
КонецФункции

#КонецОбласти
